# Model Exercises
Using the titanic data, in your classification-exercises repository, create a notebook, model.ipynb where you will do the following:

In [28]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import scipy.stats

import os
import acquire
import prepare

In [29]:
import warnings
warnings.filterwarnings("ignore")
import seaborn as sns

from pydataset import data

from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier, plot_tree
from sklearn.metrics import classification_report
from sklearn.metrics import confusion_matrix

## 1. 
- What is your baseline prediction?
- What is your baseline accuracy?
Remember: your baseline prediction for a classification problem is predicting the most prevelant class in the training dataset (the mode). When you make those predictions, what is your accuracy? This is your baseline accuracy.

In [50]:
titanic = acquire.get_titanic_data()
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [48]:
titanic.shape

(891, 13)

In [35]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  891 non-null    int64
 1   survived      891 non-null    int64
 2   pclass        891 non-null    int64
 3   sex           891 non-null    object
 4   age           714 non-null    float64
 5   sibsp         891 non-null    int64
 6   parch         891 non-null    int64
 7   fare          891 non-null    float64
 8   embarked      889 non-null    object
 9   class         891 non-null    object
 10  deck          203 non-null    object
 11  embark_town   889 non-null    object
 12  alone         891 non-null    int64
dtypes: float64(2), int64(6), object(5)
memory usage: 97.5+ KB

In [38]:
titanic.survived.mean()

0.3838383838383838

In [57]:
train, validate, test = prepare.prep_titanic_data(titanic)
train

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embark_town,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
583,583,0,1,male,36.000000,0,0,40.1250,Cherbourg,1,1,0,0
165,165,1,3,male,9.000000,0,2,20.5250,Southampton,0,1,0,1
50,50,0,3,male,7.000000,4,1,39.6875,Southampton,0,1,0,1
259,259,1,2,female,50.000000,0,1,26.0000,Southampton,0,0,0,1
306,306,1,1,female,29.678105,0,0,110.8833,Cherbourg,1,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
313,313,0,3,male,28.000000,0,0,7.8958,Southampton,1,1,0,1
636,636,0,3,male,32.000000,0,0,7.9250,Southampton,1,1,0,1
222,222,0,3,male,51.000000,0,0,8.0500,Southampton,1,1,0,1
485,485,0,3,female,29.678105,3,1,25.4667,Southampton,0,0,0,1
744,744,1,3,male,31.000000,0,0,7.9250,Southampton,1,1,0,1

#### My baseline prediction: Most passengers did not survive.